Revit 2026 API

# DocumentPreviewSettings Methods

---

The DocumentPreviewSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | ForceViewUpdate | Sets Revit to update the preview view if necessary. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsViewIdValidForPreview | Identifies if the view id is valid as a preview view id. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DocumentPreviewSettings Class

Autodesk.Revit.DB Namespace